package org.dcache.vfs4j;

import com.google.common.base.Throwables;
import com.google.common.cache.CacheBuilder;
import com.google.common.cache.CacheLoader;
import com.google.common.cache.LoadingCache;
import com.google.common.cache.RemovalListener;
import com.google.common.cache.RemovalNotification;

import java.io.Closeable;
import java.io.File;
import java.io.IOException;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.nio.ByteBuffer;
import java.nio.ByteOrder;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.NoSuchElementException;
import java.util.TreeSet;
import java.util.concurrent.CompletableFuture;
import java.util.concurrent.CompletionException;
import java.util.concurrent.ExecutionException;
import javax.annotation.Nonnull;
import javax.security.auth.Subject;

import jdk.incubator.foreign.CLinker;
import jdk.incubator.foreign.FunctionDescriptor;
import jdk.incubator.foreign.GroupLayout;
import jdk.incubator.foreign.MemoryAddress;
import jdk.incubator.foreign.MemoryLayout;
import jdk.incubator.foreign.MemorySegment;
import jdk.incubator.foreign.ResourceScope;
import jdk.incubator.foreign.SymbolLookup;
import org.dcache.nfs.status.*;

import org.dcache.nfs.util.UnixSubjects;
import org.dcache.nfs.v4.NfsIdMapping;
import org.dcache.nfs.v4.SimpleIdMap;
import org.dcache.nfs.v4.xdr.nfsace4;
import org.dcache.nfs.vfs.AclCheckable;
import org.dcache.nfs.vfs.DirectoryEntry;

  private static final int O_PATH = 010000000;
  private static final int O_NOFOLLOW = 0400000;
  private static final int O_EXCL = 0200;
  private static final int O_CREAT = 0100;

  private static final int AT_SYMLINK_NOFOLLOW = 0x100;
  private static final int AT_REMOVEDIR = 0x200;
  private static final int AT_EMPTY_PATH = 0x1000;

  private final KernelFileHandle rootFh;
  protected final int rootFd;

  private final NfsIdMapping idMapper = new SimpleIdMap();

  /** Cache of opened files used by read/write operations. */
  private final LoadingCache<Inode, SystemFd> _openFilesCache;

  /** Cache of directories for fast lookup. */
  private final LoadingCache<Inode, SystemFd> _openDirCache;

  // as in bits/statx-generic.h
  private final static int STATX_TYPE = 0x0001;
  private final static int STATX_MODE = 0x0002;
  private final static int STATX_NLINK = 0x0004;
  private final static int STATX_UID = 0x0008;
  private final static int STATX_GID = 0x0010;
  private final static int STATX_ATIME = 0x0020;
  private final static int STATX_MTIME = 0x0040;
  private final static int STATX_CTIME = 0x0080;
  private final static int STATX_INO = 0x0100;
  private final static int STATX_SIZE = 0x0200;
  private final static int STATX_BLOCKS = 0x0400;
  private final static int STATX_BASIC_STATS = 0x07ff;
  private final static int STATX_ALL = 0x0fff;

  private final static int STATX_BTIME = 0x0800;
  private final static int STATX_MNT_ID = 0x1000;
  private final static int STATX__RESERVED = 0x80000000;
  private final static int STATX_ATTR_COMPRESSED = 0x0004;
  private final static int STATX_ATTR_IMMUTABLE = 0x0010;
  private final static int STATX_ATTR_APPEND = 0x0020;
  private final static int STATX_ATTR_NODUMP = 0x0040;
  private final static int STATX_ATTR_ENCRYPTED = 0x0800;
  private final static int STATX_ATTR_AUTOMOUNT = 0x1000;
  private final static int STATX_ATTR_MOUNT_ROOT = 0x2000;
  private final static int STATX_ATTR_VERITY = 0x100000;
  private final static int STATX_ATTR_DAX = 0x200000;

  // struct statx layout as in bits/types/struct_statx.h
  public static final GroupLayout STATX_LAYOUT = MemoryLayout.structLayout(

          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_mask"), /* Mask of bits indicating filled fields. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_blksize"), /* Optimal block size for IO.*/
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_attributes"), /* Extra file attribute indicators. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_nlink"), /* Object link count.	*/
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_uid"), /* User ID of the file's owner. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_gid"), /* Group ID of the file's owner.*/
          MemoryLayout.valueLayout(16, ByteOrder.nativeOrder()).withName("stx_mode"), /* File type and mode.	*/
          MemoryLayout.paddingLayout(16), /* padding */

          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_ino"), /* File inode number.	*/
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_size"), /* File's size in bytes.*/
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_blocks"), /* Number of 512-byte blocks allocated */
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_attributes_mask"), /* Mask of supported attributes */

          /* The following fields are file timestamps */
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_atime"), /* Last access, sec. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_atimensec"), /* Last access, nannoseconds.*/
          MemoryLayout.paddingLayout(32), /* padding */

          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_btime"), /* Creation time, sec. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_btimensec"), /* Creation time, nannoseconds.*/
          MemoryLayout.paddingLayout(32), /* padding */

          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_ctime"), /* Status change time, sec. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_ctimensec"), /* Status change time, nannoseconds.*/
          MemoryLayout.paddingLayout(32), /* padding */

          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_mtime"), /* Last modification access, sec. */
          MemoryLayout.valueLayout(32, ByteOrder.nativeOrder()).withName("stx_mtimensec"), /* Last modification access, nannoseconds.*/
          MemoryLayout.paddingLayout(32), /* padding */

           /* If this file represents a device, then the next two fields contain the ID of the device */
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_rdev_min"), /* Device. */
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_rdev_maj"), /* Device number, if device.*/

           /* The next two fields contain the ID of the device containing the filesystem where the file resides */

          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_dev_min"), /* Device. */
          MemoryLayout.valueLayout(64, ByteOrder.nativeOrder()).withName("stx_rdev_max"), /* Device number, if device.*/

          MemoryLayout.sequenceLayout(14, MemoryLayout.paddingLayout(64)) /* padding*/
  );

  private static final MemoryLayout STAT_FS_LAYOUT = MemoryLayout.structLayout(
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("type"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("bsize"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("block"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("free"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("bavail"),

          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("files"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("ffree"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("fsid"),
          MemoryLayout.valueLayout(Long.SIZE, ByteOrder.nativeOrder()).withName("namelen"),
